``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.jenkins-workers-silver[0] will be updated in-place
  ~ resource "aws_route53_record" "jenkins-workers-silver" {
        id              = "Z386N8B8JBC6TQ_worker-0.silver.build.galaxyproject.eu_A"
        name            = "worker-0.silver.build.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.119",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.jenkins-workers-silver[0] will be created
  + resource "openstack_compute_instance_v2" "jenkins-workers-silver" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "jenkins-worker-v60-j105-d1dfcf46c4cd-main"
      + key_pair            = "jenkins2"
      + name                = "worker-0.silver.build.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "0cd3c1a9d50fa22664f4bfbf321c9a4aa50007a1"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.jenkins-workers-silver-va[0] will be created
  + resource "openstack_compute_volume_attach_v2" "jenkins-workers-silver-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "5a8009f3-4007-45f1-98eb-50634d8dbc51"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```